nxp-mcuxpresso/mcux-soc-svd/MCXA366/MCXA366.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>UDF0</name>
      <description>no description available</description>
      <groupName>UDF</groupName>
      <baseAddress>0x400ED000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>udf_ctrl</name>
          <description>Control register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x800000</resetValue>
          <resetMask>0x71C7FFFF</resetMask>
          <fields>
            <field>
              <name>salt</name>
              <description>Bits are internally XORed with i_custom</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>lock</name>
              <description>Lock access to UDF</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved21</name>
              <description>RFU</description>
              <bitOffset>19</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>udf_en</name>
              <description>Enable the UDF block</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved25</name>
              <description>RFU</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved27</name>
              <description>RFU</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>flush</name>
              <description>Flush UDF and return to reset state</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>reserved31</name>
              <description>reserved</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>udf_status</name>
          <description>Status register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>o_status</name>
              <description>Status bits</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>reset</name>
                  <description>5'b00001 = Reset</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>init</name>
                  <description>5'b00010 = Init</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>warmup</name>
                  <description>5'b00100 = Warmup</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ready</name>
                  <description>5'b01000 = Ready</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>error</name>
                  <description>5'b10000 = Error</description>
                  <value>0x10</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>rsv</name>
              <description>RFU</description>
              <bitOffset>5</bitOffset>
              <bitWidth>26</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>o_wait</name>
              <description>Indicates UDF is processing data</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>udf_wr_data</name>
          <description>Data In Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>i_dat</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>udf_rd_data</name>
          <description>Data Out Register</description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>o_dat</name>
              <description>no description available</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
