nxp-mcuxpresso/mcux-soc-svd/MCXA366/MCXA366.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>NVIC</name>
      <description>Nested Vectored Interrupt Controller</description>
      <groupName>NVIC</groupName>
      <baseAddress>0xE000E100</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0xE04</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>Reserved16</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>CMC</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH2</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH4</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH5</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH6</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA_CH7</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>ERM0_SINGLE_BIT</name>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>ERM0_MULTI_BIT</name>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>FMU0</name>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>GLIKEY0</name>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>MBC0</name>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>SCG0</name>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>SPC0</name>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>TDET</name>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>WUU0</name>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>CAN0</name>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>CAN1</name>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>FLEXIO</name>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>I3C0</name>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>LPI2C0</name>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>LPI2C1</name>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>LPSPI0</name>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>LPSPI1</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>LPUART0</name>
        <value>31</value>
      </interrupt>
      <interrupt>
        <name>LPUART1</name>
        <value>32</value>
      </interrupt>
      <interrupt>
        <name>LPUART2</name>
        <value>33</value>
      </interrupt>
      <interrupt>
        <name>LPUART3</name>
        <value>34</value>
      </interrupt>
      <interrupt>
        <name>LPUART4</name>
        <value>35</value>
      </interrupt>
      <interrupt>
        <name>USB0</name>
        <value>36</value>
      </interrupt>
      <interrupt>
        <name>CDOG0</name>
        <value>38</value>
      </interrupt>
      <interrupt>
        <name>CTIMER0</name>
        <value>39</value>
      </interrupt>
      <interrupt>
        <name>CTIMER1</name>
        <value>40</value>
      </interrupt>
      <interrupt>
        <name>CTIMER2</name>
        <value>41</value>
      </interrupt>
      <interrupt>
        <name>CTIMER3</name>
        <value>42</value>
      </interrupt>
      <interrupt>
        <name>CTIMER4</name>
        <value>43</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_RELOAD_ERROR</name>
        <value>44</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_FAULT</name>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE0</name>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE1</name>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE2</name>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM0_SUBMODULE3</name>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_COMPARE</name>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_HOME</name>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_WATCHDOG</name>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>EQDC0_INDEX</name>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>FREQME0</name>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>LPTMR0</name>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>OS_EVENT</name>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>WAKETIMER0</name>
        <value>58</value>
      </interrupt>
      <interrupt>
        <name>UTICK0</name>
        <value>59</value>
      </interrupt>
      <interrupt>
        <name>WWDT0</name>
        <value>60</value>
      </interrupt>
      <interrupt>
        <name>ADC0</name>
        <value>62</value>
      </interrupt>
      <interrupt>
        <name>ADC1</name>
        <value>63</value>
      </interrupt>
      <interrupt>
        <name>CMP0</name>
        <value>64</value>
      </interrupt>
      <interrupt>
        <name>CMP1</name>
        <value>65</value>
      </interrupt>
      <interrupt>
        <name>CMP2</name>
        <value>66</value>
      </interrupt>
      <interrupt>
        <name>DAC0</name>
        <value>67</value>
      </interrupt>
      <interrupt>
        <name>GPIO0</name>
        <value>71</value>
      </interrupt>
      <interrupt>
        <name>GPIO1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO3</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>GPIO4</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>LPI2C2</name>
        <value>77</value>
      </interrupt>
      <interrupt>
        <name>LPI2C3</name>
        <value>78</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_RELOAD_ERROR</name>
        <value>79</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_FAULT</name>
        <value>80</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_SUBMODULE0</name>
        <value>81</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_SUBMODULE1</name>
        <value>82</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_SUBMODULE2</name>
        <value>83</value>
      </interrupt>
      <interrupt>
        <name>FLEXPWM1_SUBMODULE3</name>
        <value>84</value>
      </interrupt>
      <interrupt>
        <name>EQDC1_COMPARE</name>
        <value>85</value>
      </interrupt>
      <interrupt>
        <name>EQDC1_HOME</name>
        <value>86</value>
      </interrupt>
      <interrupt>
        <name>EQDC1_WATCHDOG</name>
        <value>87</value>
      </interrupt>
      <interrupt>
        <name>EQDC1_INDEX</name>
        <value>88</value>
      </interrupt>
      <interrupt>
        <name>LPUART5</name>
        <value>95</value>
      </interrupt>
      <interrupt>
        <name>MAU</name>
        <value>107</value>
      </interrupt>
      <interrupt>
        <name>SMARTDMA</name>
        <value>108</value>
      </interrupt>
      <interrupt>
        <name>CDOG1</name>
        <value>109</value>
      </interrupt>
      <interrupt>
        <name>PKC</name>
        <value>110</value>
      </interrupt>
      <interrupt>
        <name>SGI</name>
        <value>111</value>
      </interrupt>
      <interrupt>
        <name>TRNG0</name>
        <value>113</value>
      </interrupt>
      <interrupt>
        <name>SECURE_ERR</name>
        <value>114</value>
      </interrupt>
      <interrupt>
        <name>ADC2</name>
        <value>116</value>
      </interrupt>
      <interrupt>
        <name>ADC3</name>
        <value>117</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <value>119</value>
      </interrupt>
      <interrupt>
        <name>RTC_1HZ</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>LCD</name>
        <value>121</value>
      </interrupt>
      <registers>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>ISER[%s]</name>
          <description>Interrupt Set Enable Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETENA0</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA1</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA2</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA3</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA4</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA5</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA6</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA7</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA8</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA9</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA10</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA11</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA12</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA13</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA14</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA15</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA16</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETENA17</name>
              <description>Interrupt set-enable bits.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Write: No effect; Read: Interrupt 32n+m disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Write: Enable interrupt 32n+m; Read: Interrupt 32n+m enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
